<?
header('Content-Type: text/html; charset=utf-8');
require_once 'includes/global.inc.php';
$db = new DB();

$viloyatlar = [
    'Фаргона вилояти халқ қабулхонаси',
    'Фаргона вилояти халқ қабулхонаси',
    'Фаргона вилояти халқ қабулхонаси',
    'Ферганская народная приёмная',
    'Фаргона вилояти халқ қабулхонаси',
    'Фаргона вилояти халқ қабулхонаси',
    'Ферганская народная приёмная',
    'Жиззах вилояти халқ қабулхонаси',
    'Джизакская народная приёмная',
    'Жиззах вилояти халқ қабулхонаси',
    'Жиззах вилояти халқ қабулхонаси',
    'Жизакская народная приёмная',
    'Жиззах вилояти халқ қабулхонаси',
    'Жиззах вилояти халқ қабулхонаси',
    'Қашқадарё вилояти халқ қабулхонаси',
    'Қашқадарё вилояти халқ қабулхонаси',
    'Кашкадаринская народная приёмная',
    'Қашқадарё вилояти халқ қабулхонаси',
    'Қашқадарё вилояти халқ қабулхонаси',
    'Қашқадарё вилояти халқ қабулхонаси',
    'Қашқадарё вилояти халқ қабулхонаси',
    'Ташкентская народная приёмная',
    'Тошкент шаҳар халқ қабулхонаси',
    'Сирдарё вилояти халқ қабулхонаси',
    'Самарқанд вилояти халқ қабулхонаси',
    'Наманганская народная приёмная',
    'Андижон вилояти халқ қабулхонаси',
    'Сурхондарё вилояти халқ қабулхонаси',
    'Навоийская народная приёмная',
    'Бухоро вилояти халқ қабулхонаси',
    'Хоразм вилояти халқ қабулхонаси',
    'Қорақалпоқистон Республикаси халқ қабулхонаси',
];

$ishhonalar = [
    'Адлия Вазирлиги',
    'Adliya vazirligi',
    'Қуролли кучлар вазирлиги',
    'Ўзбекистон Республикаси Адлия Вазирлиги',
    'Ўзбекистон Республикаси адлия вазирлиги',
    'Ўзбекистон Адлия Вазирлиги',
    'O`zbekiston Respublikasi Adliya vazirligi',
    'Алоқа вазирлиги',
    'Фарма',
];

for ($i = 0; $i<200; $i++){
    $field1 = join(',',[rand(1,10), rand(11,20), 21]);
    $field2 = rand([1,1,1,1,1,1,2,3,4,5,6,7,8,8,8]);
    $field3 = rand(1,4);
    $field4 = rand(1,6);
    if($field2 == 8){

    }
    $data = [
        'field1' => $field1,
        'field2' => $field2,
        'field3' => $field3,
        'field4' => $field4,
        'field121' => $viloyatlar[array_rand($viloyatlar)],
        'field28' => $ishhonalar[array_rand($ishhonalar)],
        'time' => rand(1515738147, time()),
    ];
    //var_dump($data);
    //$db->insert($data, 'muloqot');
}
